Revit 2024 API
PaperSizeSetIterator Class
An iterator to a set of paper size objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class PaperSizeSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class PaperSizeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class PaperSizeSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PaperSizeSetIterator
See Also
PaperSizeSetIterator Members
Autodesk.Revit.DB Namespace